In [59]:
import numpy as np
import pandas as pd

In [60]:
df = pd.read_csv("dataset/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,NaN,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,NaN,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,NaN,NaN,S
3,4,NaN,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1.0,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1.0,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0.0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     887 non-null    float64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          713 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         888 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

In [62]:
df.isnull().sum()

PassengerId      0
Survived         4
Pclass           0
Name             0
Sex              0
Age            178
SibSp            0
Parch            0
Ticket           0
Fare             3
Cabin          687
Embarked         2
dtype: int64

In [63]:
df.drop(['PassengerId','Ticket','Fare','Cabin','Name'],inplace=True,axis=1)

In [64]:
df

     Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0.0       3    male  22.0      1      0        S
1         NaN       1  female  38.0      1      0        C
2         NaN       3  female   NaN      0      0        S
3         NaN       1  female  35.0      1      0        S
4         0.0       3    male  35.0      0      0        S
..        ...     ...     ...   ...    ...    ...      ...
886       0.0       2    male  27.0      0      0        S
887       1.0       1  female  19.0      0      0        S
888       0.0       3  female   NaN      1      2        S
889       1.0       1    male  26.0      0      0        C
890       0.0       3    male  32.0      0      0        Q

[891 rows x 7 columns]

In [65]:
x = df.iloc[:,1:]
x

     Pclass     Sex   Age  SibSp  Parch Embarked
0         3    male  22.0      1      0        S
1         1  female  38.0      1      0        C
2         3  female   NaN      0      0        S
3         1  female  35.0      1      0        S
4         3    male  35.0      0      0        S
..      ...     ...   ...    ...    ...      ...
886       2    male  27.0      0      0        S
887       1  female  19.0      0      0        S
888       3  female   NaN      1      2        S
889       1    male  26.0      0      0        C
890       3    male  32.0      0      0        Q

[891 rows x 6 columns]

In [66]:
y = df.iloc[:,0]
y

0      0.0
1      NaN
2      NaN
3      NaN
4      0.0
      ...
886    0.0
887    1.0
888    0.0
889    1.0
890    0.0
Name: Survived, Length: 891, dtype: float64

In [67]:
df['Survived'].fillna(method='ffill',inplace=True)

In [68]:
df['Age'].fillna(method='ffill',inplace=True)

In [69]:
df['Embarked'].fillna(method='ffill',inplace=True)

In [70]:
df['Survived'].isnull().sum()

0

In [71]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
tr = ColumnTransformer(transformers=[
    ('t1',SimpleImputer(),['Age']),
    ('t2',OneHotEncoder(drop='first',sparse=False),['Sex','Embarked'])
], remainder='passthrough')

In [72]:
x1=tr.fit_transform(x)
x1

array([[22.        ,  1.        ,  0.        , ...,  3.        ,
         1.        ,  0.        ],
       [38.        ,  0.        ,  0.        , ...,  1.        ,
         1.        ,  0.        ],
       [29.70430575,  0.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       ...,
       [29.70430575,  0.        ,  0.        , ...,  3.        ,
         1.        ,  2.        ],
       [26.        ,  1.        ,  0.        , ...,  1.        ,
         0.        ,  0.        ],
       [32.        ,  1.        ,  1.        , ...,  3.        ,
         0.        ,  0.        ]])

In [73]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x1,y,test_size=0.2,train_size=0.8)

In [74]:
x_train

array([[29.        ,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       [29.70430575,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       [21.        ,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       ...,
       [29.        ,  1.        ,  0.        , ...,  3.        ,
         1.        ,  0.        ],
       [29.70430575,  1.        ,  1.        , ...,  3.        ,
         1.        ,  0.        ],
       [33.        ,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ]])

In [75]:
x_test

array([[43.        ,  0.        ,  0.        , ...,  1.        ,
         0.        ,  1.        ],
       [30.        ,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       [24.        ,  0.        ,  0.        , ...,  2.        ,
         2.        ,  1.        ],
       ...,
       [22.        ,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       [29.70430575,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ],
       [29.70430575,  1.        ,  0.        , ...,  3.        ,
         0.        ,  0.        ]])

In [76]:
y_train

81     1.0
643    1.0
51     0.0
237    1.0
294    0.0
      ...
785    0.0
365    0.0
477    0.0
214    0.0
103    0.0
Name: Survived, Length: 712, dtype: float64

In [77]:
y_test

779    1.0
798    0.0
600    1.0
560    0.0
29     0.0
      ...
110    0.0
274    1.0
243    0.0
410    0.0
354    0.0
Name: Survived, Length: 179, dtype: float64

In [78]:
from sklearn.tree import DecisionTreeClassifier

In [79]:
dtc = DecisionTreeClassifier()

In [80]:
dtc.fit(x_train,y_train)

DecisionTreeClassifier()

In [81]:
y_pred = dtc.predict(x_test)

In [82]:
y_pred

array([1., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 1., 0.,
       1., 0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0.,
       0., 1., 0., 1., 0., 1., 0., 0., 0., 0., 1., 1., 0., 0., 1., 1., 0.,
       1., 0., 1., 1., 0., 1., 0., 0., 1., 0., 0., 0., 1., 0., 1., 0., 0.,
       0., 0., 1., 0., 1., 1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0.,
       1., 1., 1., 0., 1., 0., 1., 0., 0., 1., 0., 1., 0., 1., 1., 0., 0.,
       0., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0.,
       1., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0.,
       0., 0., 1., 0., 0., 1., 1., 0., 1., 0., 0., 1., 0., 0., 0., 0., 1.,
       1., 1., 0., 1., 0., 1., 0., 0., 0.])

In [84]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [85]:
print("Accuracy matrix =",accuracy_score(y_test,y_pred))

Accuracy matrix = 0.7877094972067039

In [86]:
pd.DataFrame(confusion_matrix(y_test,y_pred))# if all the values are come along the diagonal then accuracy is 100%

    0   1
0  91  10
1  28  50

In [87]:
result = pd.DataFrame()
result['Actual Label'] = y_test
result['Dexision Tree Prediction'] = y_pred

In [88]:
result

     Actual Label  Dexision Tree Prediction
779           1.0                       1.0
798           0.0                       0.0
600           1.0                       1.0
560           0.0                       0.0
29            0.0                       0.0
..            ...                       ...
110           0.0                       0.0
274           1.0                       1.0
243           0.0                       0.0
410           0.0                       0.0
354           0.0                       0.0

[179 rows x 2 columns]